foamSolver/run/pitzDaily/0/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];
internalField   uniform 300;

boundaryField
{
   inlet
   {
       type            fixedValue;
       value           uniform 300;
   }

   outlet
   {
       type            zeroGradient;
   }

   upperWall
   {
       type            fixedValue;
       value           uniform 350;
   }

   lowerWall
   {
       type            fixedValue;
       value           uniform 320;
   }

   frontAndBack
   {
       type            empty;
   }
}